# Формат ввода
# Одна строка — весьма полезная информация.
# Формат вывода
# Трижды повторённая весьма полезная информация.

useful_data = input()
print((useful_data + '\n') * 3)